In [94]:
list_data=[1,2,3]

In [95]:
list_data2=[1,2,3,-1,5]

In [96]:
positive_negative = lambda x:'양수' if x> 0 else '음수'

In [97]:
result_pn = list(map(positive_negative, list_data2))
result_pn

['양수', '양수', '양수', '음수', '양수']

In [98]:
import pandas as pd

In [99]:
import numpy as np

In [100]:
df1 = pd.DataFrame({
    'name':['홍길동', '김길동', '홍순신', '정길동', '송사임'],
    'age':[100,200,300,150,250]
})
df1

  name  age
0  홍길동  100
1  김길동  200
2  홍순신  300
3  정길동  150
4  송사임  250

In [101]:
df1['result'] = result_pn
df1

  name  age result
0  홍길동  100     양수
1  김길동  200     양수
2  홍순신  300     양수
3  정길동  150     음수
4  송사임  250     양수

In [102]:
age_lambda = lambda x : '고령' if x >= 200 else '보통'

In [103]:
age_result = list(map(age_lambda, df1['age'])) ## map(함수, 리스트형태의 자료구조)

In [104]:
df1['age_result'] = age_result
df1

  name  age result age_result
0  홍길동  100     양수         보통
1  김길동  200     양수         고령
2  홍순신  300     양수         고령
3  정길동  150     음수         보통
4  송사임  250     양수         고령

In [105]:
##람다함수를 만들어보세요
## name에 '홍'이라는 글자를 포함하고 있으면 1, 아니면 0
## 결과를 name_result변수
name_lambda = lambda name : 1 if '홍' in name else 0
name_result = list(map(name_lambda, df1['name']))
df1['name_result'] = name_result
df1

  name  age result age_result  name_result
0  홍길동  100     양수         보통            1
1  김길동  200     양수         고령            0
2  홍순신  300     양수         고령            1
3  정길동  150     음수         보통            0
4  송사임  250     양수         고령            0

In [106]:
1 in [1,2,3] # in 리슽, 리스트내에 1을 포함하는지

True

In [107]:
## 참석확인하려고 하는 이름이 '홍길동'
## 참석자리스트가 '김길동', '박길동', '송길동'
## 포함여부 확인용 --> in, not in

In [109]:
name = input('확인하고 싶은 이름 입력>>')
check_name = lambda name : '참석' if name in list(df1['name']) else '불참석'
check_result = check_name(name)
check_result

확인하고 싶은 이름 입력>> 홍길동

'참석'

In [110]:
# df의 result 변수의 값이 양수이면 1, 음수이면 0으로 바궈보세요.

In [111]:
df1['result'] = list(map((lambda x: 1 if x>0 else 0), list_data2))
df1

  name  age  result age_result  name_result
0  홍길동  100       1         보통            1
1  김길동  200       1         고령            0
2  홍순신  300       1         고령            1
3  정길동  150       0         보통            0
4  송사임  250       1         고령            0

In [112]:
# age_result의 값이 고령이면 1, 아니면 0으로 변경해보세요
# age를 100~200 청년, 200~250 중년, 250 이상 고령

In [113]:
df1['age_result'] = list(map(lambda x: 1 if x=='고령' else 0, df1['age_result']))
df1

  name  age  result  age_result  name_result
0  홍길동  100       1           0            1
1  김길동  200       1           1            0
2  홍순신  300       1           1            1
3  정길동  150       0           0            0
4  송사임  250       1           1            0

In [114]:
df1['age'] = list(map(lambda x: '청년' if x>=100 and x<200 else ('중년' if x >=200 and x<250 else'고령'), df1['age']))
df1

  name age  result  age_result  name_result
0  홍길동  청년       1           0            1
1  김길동  중년       1           1            0
2  홍순신  고령       1           1            1
3  정길동  청년       0           0            0
4  송사임  고령       1           1            0

In [115]:
### apply 함수 (적용시키다.)
## 컬럼명. apply(함수)

In [116]:
## 일반 함수를 만들어 apply를 적용해보세요
## 이름의 첫 글자가 송으로 시작하면 '송', 아니면 첫글자에 해당하는 글자
## 파생변수 name_apple

In [117]:
df1['name_apple'] = df1['name'].apply(lambda x: '송' if x[0] == '송' else x[0])
df1

  name age  result  age_result  name_result name_apple
0  홍길동  청년       1           0            1          홍
1  김길동  중년       1           1            0          김
2  홍순신  고령       1           1            1          홍
3  정길동  청년       0           0            0          정
4  송사임  고령       1           1            0          송